app/Http/Controllers/Auth/LoginController.php

    public function redirectTo()
    {


        // le role_id 3 correspond au collaborateur
        // le role_id 5 correspond au manager

        $roles_user = Auth::user()->roles->pluck('id');
---
select `roles`.*, `role_users`.`user_id` as `pivot_user_id`, `role_users`.`role_id` as `pivot_role_id`, `role_users`.`activiter` as `pivot_activiter` from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `role_users`.`user_id` = 67