app/Http/Controllers/CongeController.php

    public function getDetailsEmployerIdByUserId()
    {
        $id_user = Auth::user()->id;
        // donnée temporaire
        $details = Employe::where('user_id', '=', $id_user)
            ->get(['id as Employe_id',  'user_id', 'created_at', 'date_embauche']);
---
select `id`, `user_id`, `created_at` from `employes` where `user_id` = 67 limit 1

    public function getAbsenceEnAttent()
    {
        $id_employe = $this->getDetailsEmployerIdByUserId()[0]['Employe_id'];
        //dump($id_employe);
        $date_actuelle = now()->format('Y');
        $data = Conge::where('employe_id', '=', $id_employe)
            ->where('etat_conge_id', '=', 3)
            ->whereYear('debut', '=', $date_actuelle)
            ->sum('duree_conge') / 1440;
---
select sum(`duree_conge`) as aggregate from `conges` where `employe_id` is null and `etat_conge_id` = 3 and year(`debut`) = '2022'

    public function getMoisJourAbsenceEnAttent()
    {
        $id_employe = $this->getDetailsEmployerIdByUserId()[0]['id'];
        //dump($id_employe);
        $date_actuelle = now()->format('Y');
        $dateDebutMin = Conge::where('employe_id', '=', $id_employe)
            ->where('etat_conge_id', '=', 3)
            ->min('debut');
        $dateFinMax = Conge::where('employe_id', '=', $id_employe)
            ->where('etat_conge_id', '=', 3)
            ->max('fin');
---
select min(`debut`) as aggregate from `conges` where `employe_id` = 4 and `etat_conge_id` = 3