app/Http/Controllers/ReferentController.php

    public function index(Request $request)
    {

        // obtenir l'employe de l'user connecté ( si vous voulez l'utiliser comme valiable )
        $authed_emp = auth()->user()->employe;

        // Le manager peut voir la liste des congés de tous les employes de son service ( même service_id ).
        // conditions sur la relation employe des congés à afficher.
        $conges=Conge::with('employe', 'type_conge', 'etat_conge')->whereHas('employe', function ($query) use ($authed_emp) {
            $query->where('entreprise_id', $authed_emp->entreprise_id)
                // ->where('departement_entreprises_id', $authed_emp->departement_entreprises_id)
                // ->where('service_id', $authed_emp->service_id)
                ->where('id', '!=', $authed_emp->id);
        })->get(['id', 'employe_id', 'type_conge_id', 'debut', 'fin', 'j_utilise', 'motif', 'etat_conge_id']);

        // dd($conges);


        // uniquement utile pour calculer ne nombre de congé en attente initial
        // je sais pas encore comment le mettre en ajax
        $conges_en_attente=Conge::with('employe','type_conge', 'etat_conge')
                                ->where('etat_conge_id', 3)
                                ->whereHas('employe', function ($query) {
                                $query->where('entreprise_id', auth()->user()->employe->entreprise_id)
                                    // ->where('service_id', auth()->user()->employe->service_id)
                                    ->where('id', '!=', auth()->user()->employe->id);
                                })->get(['id', 'employe_id', 'type_conge_id', 'debut', 'fin', 'j_utilise', 'motif', 'etat_conge_id']);
---
select * from `employes` where `employes`.`id` in (1, 3, 4)
select `id`, `employe_id`, `type_conge_id`, `debut`, `fin`, `j_utilise`, `motif`, `etat_conge_id` from `conges` where exists (select * from `employes` where `conges`.`employe_id` = `employes`.`id` and `entreprise_id` = 1 and `id` != 2)
select * from `employes` where `employes`.`id` in (4)
select `id`, `employe_id`, `type_conge_id`, `debut`, `fin`, `j_utilise`, `motif`, `etat_conge_id` from `conges` where `etat_conge_id` = 3 and exists (select * from `employes` where `conges`.`employe_id` = `employes`.`id` and `entreprise_id` = 1 and `id` != 2)



        if ($request->ajax()) {
            $conges_en_attente=Conge::with('employe','type_conge', 'etat_conge')
                                    ->where('etat_conge_id', 3)
                                    ->whereHas('employe', function ($query) {
                                    $query->where('entreprise_id', auth()->user()->employe->entreprise_id)
                                        // ->where('service_id', auth()->user()->employe->service_id)
                                        ->where('id', '!=', auth()->user()->employe->id);
                                    })->get(['id', 'employe_id', 'type_conge_id', 'debut', 'fin', 'j_utilise', 'motif', 'etat_conge_id']);
---
select * from `employes` where `employes`.`id` in (4)
select `id`, `employe_id`, `type_conge_id`, `debut`, `fin`, `j_utilise`, `motif`, `etat_conge_id` from `conges` where `etat_conge_id` = 3 and exists (select * from `employes` where `conges`.`employe_id` = `employes`.`id` and `entreprise_id` = 1 and `id` != 2)