app/Http/Controllers/RHController.php

select `employe_id`, `type_conge_id`, `debut`, `fin`, `j_utilise`, `motif`, `etat_conge_id` from `conges`
select `employe_id`, `type_conge_id`, `debut`, `fin`, `j_utilise`, `motif`, `etat_conge_id` from `conges` where `etat_conge_id` = 3
---
    public function index(Request $request)
    {


        $calendar = Conge::get(['employe_id', 'type_conge_id', 'debut', 'fin', 'j_utilise', 'motif', 'etat_conge_id']);
        $conges_en_attente = Conge::where('etat_conge_id', 3)
        ->get(['employe_id', 'type_conge_id', 'debut', 'fin', 'j_utilise', 'motif', 'etat_conge_id']);

select * from `entreprises` where `entreprises`.`id` in (1)
select * from `services` where `services`.`id` in (1, 2, 3)
select `id`, `nom_emp`, `prenom_emp`, `email_emp`, `telephone_emp`, `service_id`, `entreprise_id`, `photos` from `employes` where `entreprise_id` = 1 and `id` != 8
---
    public function liste_employes(Request $request)
    {
       $authed_RH = auth()->user()->employe;


            $employes=Employe::with('service','service.departement','entreprise','contrat')
            ->where('entreprise_id', $authed_RH->entreprise_id)
            ->where('id', '!=', $authed_RH->id)
            ->get(['id', 'nom_emp', 'prenom_emp', 'email_emp', 'telephone_emp', 'service_id', 'entreprise_id', 'photos']);


        if ($request->ajax()) {
            $employes=Employe::with('service','service.departement','entreprise','contrat')
            ->where('entreprise_id', $authed_RH->entreprise_id)
            ->where('id', '!=', $authed_RH->id)
            ->get(['id', 'nom_emp', 'prenom_emp', 'email_emp', 'telephone_emp', 'service_id', 'entreprise_id', 'photos']);