app/Models/Conge.php

select * from `conges`
---
    public function getAll()
    {
        $query = Conge::all();

select * from `conges` inner join `conges_etats_conge` on `etat_conge_id` = `conges_etats_conge`.`id` inner join `conges_types_conge` on `type_conge_id` = `conges_types_conge`.`id` inner join `conges_frequences_solde` on `conges_types_conge`.`frequence_solde_id` = `conges_frequences_solde`.`id` inner join `employes` on `employe_id` = `employes`.`id` where `employe_id` = 4 limit 100
---
    public function getListCongesByEmpId($id_emp){
        $conges = DB::table('conges')
            ->join('conges_etats_conge', 'etat_conge_id', '=', 'conges_etats_conge.id')
            ->join('conges_types_conge', 'type_conge_id', '=', 'conges_types_conge.id')
            ->join('conges_frequences_solde', 'conges_types_conge.frequence_solde_id', '=', 'conges_frequences_solde.id')
            ->join('employes', 'employe_id', '=', 'employes.id')
            ->where('employe_id', '=', $id_emp)
            ->limit(100)
            ->get();