app/Providers/AuthServiceProvider.php

    public function boot()
    {
        $this->registerPolicies();

        // verification des roles de l'utilisateur connecté:
        // les conditions vérifient les nom de roles ( roles_name ) puisque l'id donne une référence ambiguë dans la requête.
        Gate::define('isReferent', function ($user) {

            return $user=User::where('id',Auth::user()->id)->whereHas('roles', function ($query) {
                $query->where('role_name', 'referent');
            })->exists();

        });

        Gate::define('isManager', function ($user) {

            return $user=User::where('id',Auth::user()->id)->whereHas('roles', function ($query) {
                $query->where('role_name', 'manager');
                // $query->where('role_name', 'employe')->whereHas('role_users', function ($query) {
                //     $query->where('role_id', 3)->where('activiter', 1);
                // });
                $query->where('role_users.activiter', 1);
            })->exists();

        });

        Gate::define('isEmploye', function ($user) {

            return $user=User::where('id',Auth::user()->id)->whereHas('roles', function ($query) {

                // query where the role_name is stagiaire and role_users pivot with role_id = 3 has activiter = 1
                $query->where('role_name', 'employe')->whereHas('role_users', function ($query) {
                    $query->where('role_id', 3)->where('activiter', 1);
                });



            })->exists();

        });
---
select exists(select * from `users` where `id` = 67 and exists (select * from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `users`.`id` = `role_users`.`user_id` and `role_name` = 'referent' and `role_users`.`activiter` = 1)) as `exists`
select exists(select * from `users` where `id` = 67 and exists (select * from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `users`.`id` = `role_users`.`user_id` and `role_name` = 'manager' and `role_users`.`activiter` = 1)) as `exists`

                // -----RH-----
        Gate::define('isRH', function ($user) {

            return $user=User::where('id',Auth::user()->id)->whereHas('roles', function ($query) {
                $query->where('role_name', 'RH');
            })->exists();
---
select exists(select * from `users` where `id` = 67 and exists (select * from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `users`.`id` = `role_users`.`user_id` and `role_name` = 'RH' and `role_users`.`activiter` = 1)) as `exists`